app/views/questions/new.html.erb

SELECT "experts".* FROM "experts"
---
      <h4>Subject</h4>
        <%= collection_select :expertise, :topic, Expert.all, :topic, :topic %>