app/views/questions/show.html.erb

  <% b =false %>
  <% @question.answers.each do |a| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = 1 LIMIT 1