app/controllers/admin/answers_controller.rb

  def create
    a = Answer.new
    a.question_id = params[:question_id]
    a.body = params[:body]
    a.answered = true
    a.save
---
INSERT INTO "answers" ("answered", "body", "created_at", "question_id", "researcher_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["answered", true], ["body", "bla bla bla"], ["created_at", Tue, 02 Apr 2013 06:03:42 UTC +00:00], ["question_id", 2], ["researcher_id", nil], ["updated_at", Tue, 02 Apr 2013 06:03:42 UTC +00:00]]