app/controllers/admin/expert_controller.rb

SELECT "experts".* FROM "experts"
---
  def index
    @experts = Expert.all

SELECT "experts".* FROM "experts" WHERE "experts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "experts" SET "active" = 't' WHERE "experts"."id" = 1
---
  def activate
    @expert = Expert.find params[:id]
    @expert.update_attributes(:active => true)

SELECT "experts".* FROM "experts" WHERE "experts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "experts" SET "active" = 'f' WHERE "experts"."id" = 1
---
  def deactivate
    @expert = Expert.find params[:id]
    @expert.update_attributes(:active => false)