app/controllers/admin/researchers_controller.rb

  def index
    @researchers = Researcher.order('id ASC').all
    @experts = Expert.all
---
SELECT "researchers".* FROM "researchers" ORDER BY id ASC
SELECT "experts".* FROM "experts"

  def activate
    @researcher = Researcher.find params[:id]
    @researcher.update_attributes(:status => 1)
---
SELECT "researchers".* FROM "researchers" WHERE (email = 'ademirrafaelmg@gmail.com') LIMIT 1
UPDATE "researchers" SET "activated" = 't', "updated_at" = '2013-04-02 00:05:00.725469' WHERE "researchers"."id" = 2

  def deactivate
    @researcher = Researcher.find params[:id]
    @researcher.update_attributes(:status => 0)
---
SELECT "researchers".* FROM "researchers" WHERE (email = 'ademirrafaelmg@gmail.com') LIMIT 1
UPDATE "researchers" SET "activated" = 'f', "updated_at" = '2013-04-02 04:03:26.775892' WHERE "researchers"."id" = 2

  def activate_admin
    @researcher = Researcher.find params[:id]
    @researcher.update_attributes(:Is_Admin => true)
---
SELECT "researchers".* FROM "researchers" WHERE "researchers"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "researchers" SET "Is_Admin" = 't', "updated_at" = '2013-04-01 20:24:08.378993' WHERE "researchers"."id" = 2

  def deactivate_admin
    @researcher = Researcher.find params[:id]
    @researcher.update_attributes(:Is_Admin => false)
---
SELECT "researchers".* FROM "researchers" WHERE (email = 'ademirrafaelmg@gmail.com') LIMIT 1
UPDATE "researchers" SET "Is_Admin" = 'f', "updated_at" = '2013-04-01 20:23:02.474159' WHERE "researchers"."id" = 2