app/views/researchers/new.html.erb

SELECT "experts".* FROM "experts"
---
      <%= f.label :expertise %><br />
      <td><%= collection_select :expertise, :topic, Expert.all, :topic, :topic %></td>