app/views/researchers/questions.html.erb

        <td><%= q.needed_by.strftime('%c') %></td>
        <td><%= q.answers.where(:answered => true).where('body IS NOT NULL').count %></td>
        <!--<td><%= q.answers.count %></td>
---
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = 1 AND "answers"."answered" = 't' AND (body IS NOT NULL)
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = 1 AND (researcher_id = 2) LIMIT 1
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = 1

        <td><%= link_to 'View Answers', question_path(p.id) %> </td>
        <td><%= link_to 'Answer Question', edit_answer_path(Answer.find(:all, :conditions => ["researcher_id = ? and question_id = ?", current_user.id, p.id]).first.id) %> </td>
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", 1]]