app/views/admin/questions/index.html.erb

SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = 1
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = 1 AND "answers"."answered" = 't' AND (body IS NOT NULL)
---

        <td><%= q.answers.count %></td>
        <td><%= q.answers.where(:answered => true).where('body IS NOT NULL').count %></td>