app/views/admin/questions/show.html.erb

    </thead>
    <% @question.answers.each do |a| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = 1