app/controllers/answers_controller.rb

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    if current_user
      @answer = Answer.find params[:id]

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    if current_user
      @answer = Answer.find params[:id]

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "answers" SET "body" = 'bla blom', "answered" = 't', "updated_at" = '2013-04-02 17:55:44.672500' WHERE "answers"."id" = 1
---
  def update
    if current_user
      @answer = Answer.find params[:id]
      @answer.body = params[:body]
      @answer.answered = true
      @answer.save

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "answers" SET "answered" = 't', "updated_at" = '2013-04-02 22:39:39.601488' WHERE "answers"."id" = 3
---
  def no_answer
    @answer = Answer.find params[:id]
    @answer.answered = true
    @answer.save