app/controllers/questions_controller.rb

  def create
    q_params = params[:question] || params

    #Create the question
    if current_user
      q = Question.new :body => q_params[:body], :phone_number => Researcher.where("email = ?", current_user.email).first.phone_number, :email => current_user.email, :needed_by => q_params[:needed_by]
      q.needed_by ||= Time.now + 5.days
      q.topic = (params[:expertise])[:topic]
      q.save
---
SELECT 1 FROM "researchers" WHERE "researchers"."email" = 'ademirrafaelmg@hotmail.com' LIMIT 1
INSERT INTO "questions" ("body", "created_at", "email", "escalated", "needed_by", "phone_number", "topic", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "researchers" ("Is_Admin", "activated", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "expertise", "last_sign_in_at", "last_sign_in_ip", "name", "password_hash", "password_salt", "phone_number", "pref_contact", "remember_created_at", "sign_in_count", "superuser", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    if current_user
      @question = Question.find params[:id]
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "1"]]