app/controllers/researchers_controller.rb

INSERT INTO "researchers" ("Is_Admin", "activated", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "expertise", "last_sign_in_at", "last_sign_in_ip", "name", "password_hash", "password_salt", "phone_number", "pref_contact", "remember_created_at", "sign_in_count", "superuser", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    config.logger = Logger.new(STDOUT)
    @researcher = Researcher.new params[:researcher]
    @researcher.expertise = (params[:expertise])[:topic]
    @researcher.setPrivacy
    if @researcher.save

SELECT "questions".* FROM "questions" WHERE (email = 'invstg8net@gmail.com')
SELECT question_id FROM "answers" WHERE (researcher_id = 2)
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1
SELECT "answers".* FROM "answers" WHERE (researcher_id = 2) AND (question_id = 1) LIMIT 1
---
  def questions
    if current_user
      email = current_user.email
      @questions = Question.where("email = ?", email)
      ans = Answer.where("researcher_id = ?", Researcher.where("email = ?", email).first).pluck(:question_id)
      @aquestions = Question.where(:id => ans)
      @answers = Answer.all

SELECT "researchers".* FROM "researchers" WHERE (email = 'invstg8net@gmail.com')
---
  def account
    if current_user
      email = current_user.email
      @researcher = Researcher.where("email = ?", email)

SELECT "researchers".* FROM "researchers" WHERE (email = 'invstg8net@gmail.com') LIMIT 1
---
  def edit
    if current_user
      email = current_user.email
      @researcher = Researcher.where("email = ?", email).first

SELECT "researchers".* FROM "researchers" WHERE (email = 'invstg8net@gmail.com') LIMIT 1
---
  def show
    if current_user
      email = current_user.email
      @researcher = Researcher.where("email = ?", email).first

SELECT 1 FROM "researchers" WHERE ("researchers"."email" = 'invstg8net@gmail.com' AND "researchers"."id" != 1) LIMIT 1
UPDATE "researchers" SET "expertise" = 'Weather', "name" = 'Ademir', "password_salt" = '$2a$10$/RCJwpJ.Zj5hSlh0mZsgO.', "password_hash" = '$2a$10$/RCJwpJ.Zj5hSlh0mZsgO.gzsSALgCtGP2QWxleu5tvpOB8lfdTRi', "updated_at" = '2013-04-05 20:29:23.900484' WHERE "researchers"."id" = 3
---
  def update
    if current_user
      email = current_user.email
      @researcher = Researcher.where("email = ?", email).first
      @researcher.expertise = (params[:expertise])[:topic]
      respond_to do |format|
        if @researcher.update_attributes(params[:researcher])